var Admin = require('../models/admin')
    , Counters = require('../models/counters')
    , Sidebar = require('../models/sidebar')
    , Category = require('../models/category')
    , Post = require('../models/post')
	, Employer = require('../models/employer')
	, City = require('../models/city')
	, Http = require('http')
    , Search = require('../models/search')
	, elasticConf = {
	  	index: "test",
		typePost: "post" 
	};
	

/*params :
 *data - JSON, который нужно передать шаблону или отобразить, также включащий в себя флаг относительно JSON. Если это значение == false, то будет редирект
 *adress - название template, если будет рендеринг или адрес, по которому будет редиректиться
 *res - объекта ответа
 *code - код редиректа(необязательный)
 */
var rendering = function(data, address, res,  code){
    if(!data) return res.render(redirectCode||200, redirect);
    if(data.JSON) return res.send(data);
    return res.render(address, data);
};

exports.newAdmin = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        return res.redirect('/admin');
	}, function(){
        return res.render('admin/new-admin');
    });
};

exports.createAdmin = function(req, res){
    if(!req.body.login || !req.body.pass) return res.send({result:0, code: 'badreq'});
    return Admin.registration(req.body)
	.then(function(data){
        res.send(data);
    }, function(data){
		res.send(data);
	});
};

exports.auth = function(req, res){
    Admin.updateLink(req)
	.then(function(data){
        return res.redirect('/admin');
	}, function(){
        return res.render('admin/authorization');
    });
};

exports.enter = function(req, res){
    if(!req.body || !req.body.login || !req.body.pass) return res.send({result:0, code:'nodata'});
    return Admin.enter(2, req)
	.then(function(data){
        return res.send({key:data.key, id:data.id});
    }, function(data){
		return res.send(data);
	});
};

exports.panel = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup!=2) return res.render('admin/authorization', {url: req.url});
		return Employer.getList(req.query.page)
        .then(function(data){
            return res.render('admin/panel',{userGroup:link.userGroup, emps: data});
        }, function(err){
            res.send(err);
        });
    }, function(link){
		return res.render('admin/authorization', {url: req.url});
	})
};

exports.exit = function(req, res){
    Admin.exit(req.session.userId)
	.then(function(){
        res.redirect('admin_auth');
    });
};

exports.categories = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup !=2) return res.redirect(404,'/error');
        return [Category.getTree(0, false), link];
    }, function(){
		return res.redirect(404,'/error');
	})
	.spread(function(tree, link){
        return res.render('category/categories',{categories:tree.result, userGroup:link.userGroup});
    }, function(err){
		return res.send({result:0, code: 'db', message: err});
	});
};

exports.newCategory = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup!=2) return res.redirect(404,'/error');
        return res.render('category/new-category', {userGroup: link.userGroup});
    },function(){
		return res.redirect(404,'/error');
	});
};

exports.createCategory = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup != 2) return res.redirect(404, '/error');
        if(!req.body.title || !req.body.parent) return res.send({code:'badreq'});
        return Category.newOne(req.body.title, req.body.parent)
    }, function(){
		return res.redirect(404, '/error');
	})
	.then(function(catData){
        return res.redirect('/admin/categories');
    }, function(err){
		return res.send(err);
	});
};



exports.switchCategory = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup!=2) return res.redirect(404, 'error');
        return [Category.findOne({id:req.param('id')}, 'isActive').exec(), link];
    }, function(){
		res.redirect(404, 'error');
	})
	.spread(function(result, link){
        if(!result) return res.send({code:404});
		result.isActive = !result.isActive;
        return result.save(function(err){
            if(err) return res.send({result:0,code:'db', message:err});
            return res.redirect('/admin/categories');
        });
    }, function(err){
		return res.send({code: 'db', message: err});
	});
};

exports.updateCategory = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup!=2) return res.redirect(404, 'error');
        return [Category.findOne({id:req.param('id')}, 'title id parent').exec(), link];
    }, function(){
		return res.redirect(404, 'error');
	})
	.then(function(result, link){
        if(!result) return res.send({code:404});
        return res.render('category/edit-category', {category: result, userGroup: link.userGroup});
    }, function(err){
		return res.send({code:'db', message:err});
	});
};

exports.saveCategory = function(req, res){
    Admin.updateLink(req)
	.then(function(link){
        if(link.userGroup!=2) return res.redirect(404, 'error');
        return Category.findOne({id:req.param('id')}, 'title id parent').exec()
    }, function(){
		return res.redirect(404, 'error');
	})
	.then(function(result){
        if(!result) return res.send({code:404});
        for(key in result){
            if(req.body[key]) result[key] = req.body[key];
        }
        return result.save(function(err){
            if(err) return res.send({code:'db', message: err});
			return res.redirect('/admin/categories');
        });
    }, function(err){
		return res.send({code:'db', message:err});
	});
};

exports.ban = function(req, res){
	Admin.ban(req.param('id'))
	.then(function(data){
		return res.redirect('/admin');
	}, function(){
		return res.send(data);
	});
};

exports.unBan = function(req, res){
	Admin.unBan(req.param('id'))
	.then(function(data){
		return res.redirect('/admin');
	}, function(){
		return res.send(data);
	});
};

exports.readCities = function(req, res){
	var cities = ['Адыгейск','Майкоп','Горно-Алтайск','Алейск','Барнаул','Белокуриха','Бийск','Горняк','Заринск','Змеиногорск','Камень-на-Оби','Новоалтайск','Рубцовск','Славгород','Яровое','Белогорск','Благовещенск','Завитинск','Зея','Райчихинск','Свободный','Сковородино','Тында','Шимановск','Архангельск','Вельск','Каргополь','Коряжма','Котлас','Мезень','Мирный','Новодвинск','Няндома','Онега','Северодвинск','Сольвычегодск','Шенкурск','Астрахань','Ахтубинск','Знаменск','Камызяк','Нариманов','Харабали','Агидель','Баймак','Белебей','Белорецк','Бирск','Благовещенск','Давлеканово','Дюртюли','Ишимбай','Кумертау','Межгорье','Мелеуз','Нефтекамск','Октябрьский','Салават','Сибай','Стерлитамак','Туймазы','Уфа','Учалы','Янаул','Алексеевка','Белгород','Бирюч','Валуйки','Грайворон','Губкин','Короча','Новый Оскол','Старый Оскол','Строитель','Шебекино','Брянск','Дятьково','Жуковка','Злынка','Карачев','Клинцы','Мглин','Новозыбков','Почеп','Севск','Сельцо','Стародуб','Сураж','Трубчевск','Унеча','Фокино','Бабушкин','Гусиноозёрск','Закаменск','Кяхта','Северобайкальск','Улан-Удэ','Александров','Владимир','Вязники','Гороховец','Гусь-Хрустальный','Камешково','Карабаново','Киржач','Ковров','Кольчугино','Костерёво','Курлово','Лакинск','Меленки','Муром','Петушки','Покров','Радужный','Собинка','Струнино','Судогда','Суздаль','Юрьев-Польский','Волгоград','Волжский','Дубовка','Жирновск','Калач-на-Дону','Камышин','Котельниково','Котово','Краснослободск','Ленинск','Михайловка','Николаевск','Новоаннинский','Палласовка','Петров Вал','Серафимович','Суровикино','Урюпинск','Фролово','Бабаево','Белозерск','Великий Устюг','Вологда','Вытегра','Грязовец','Кадников','Кириллов','Красавино','Никольск','Сокол','Тотьма','Устюжна','Харовск','Череповец','Бобров','Богучар','Борисоглебск','Бутурлиновка','Воронеж','Калач','Лиски','Нововоронеж','Новохопёрск','Острогожск','Павловск','Поворино','Россошь','Семилуки','Эртиль','Буйнакск','Дагестанские Огни','Дербент','Избербаш','Каспийск','Кизилюрт','Кизляр','Махачкала','Хасавюрт','Южно-Сухокумск','Биробиджан','Облучье','Балей','Борзя','Краснокаменск','Могоча','Нерчинск','Петровск-Забайкальский','Сретенск','Хилок','Чита','Шилка','Вичуга','Гаврилов Посад','Заволжск','Иваново','Кинешма','Комсомольск','Кохма','Наволоки','Плёс','Приволжск','Пучеж','Родники','Тейково','Фурманов','Шуя','Южа','Юрьевец','Карабулак','Магас','Малгобек','Назрань','Алзамай','Ангарск','Байкальск','Бирюсинск','Бодайбо','Братск','Вихоревка','Железногорск-Илимский','Зима','Иркутск','Киренск','Нижнеудинск','Саянск','Свирск','Слюдянка','Тайшет','Тулун','Усолье-Сибирское','Усть-Илимск','Усть-Кут','Черемхово','Шелехов','Баксан','Майский','Нальчик','Нарткала','Прохладный','Терек','Тырныауз','Чегем','Багратионовск','Балтийск','Гвардейск','Гурьевск','Гусев','Зеленоградск','Калининград','Краснознаменск','Ладушкин','Мамоново','Неман','Нестеров','Озёрск','Пионерский','Полесск','Правдинск','Светлогорск','Светлый','Славск','Советск','Черняховск','Приморск','Городовиковск','Лагань','Элиста','Балабаново','Белоусово','Боровск','Ермолино','Жиздра','Жуков','Калуга','Киров','Козельск','Кондрово','Кремёнки','Людиново','Малоярославец','Медынь','Мещовск','Мосальск','Обнинск','Сосенский','Спас-Деменск','Сухиничи','Таруса','Юхнов','Вилючинск','Елизово','Петропавловск-Камчатский','Карачаевск','Теберда','Усть-Джегута','Черкесск','Беломорск','Кемь','Кондопога','Костомукша','Лахденпохья','Медвежьегорск','Олонец','Петрозаводск','Питкяранта','Пудож','Сегежа','Сортавала','Суоярви','Анжеро-Судженск','Белово','Берёзовский','Гурьевск','Калтан','Кемерово','Киселёвск','Ленинск-Кузнецкий','Мариинск','Междуреченск','Мыски','Новокузнецк','Осинники','Полысаево','Прокопьевск','Салаир','Тайга','Таштагол','Топки','Юрга','Белая Холуница','Вятские Поляны','Зуевка','Киров','Кирово-Чепецк','Кирс','Котельнич','Луза','Малмыж','Мураши','Нолинск','Омутнинск','Орлов','Слободской','Советск','Сосновка','Уржум','Яранск','Воркута','Вуктыл','Емва','Инта','Микунь','Печора','Сосногорск','Сыктывкар','Усинск','Ухта','Буй','Волгореченск','Галич','Кологрив','Кострома','Макарьев','Мантурово','Нерехта','Нея','Солигалич','Чухлома','Шарья','Абинск','Анапа','Апшеронск','Армавир','Белореченск','Геленджик','Горячий Ключ','Гулькевичи','Ейск','Кореновск','Краснодар','Кропоткин','Крымск','Курганинск','Лабинск','Новокубанск','Новороссийск','Приморско-Ахтарск','Славянск-на-Кубани','Сочи','Темрюк','Тимашёвск','Тихорецк','Туапсе','Усть-Лабинск','Хадыженск','Артёмовск','Ачинск','Боготол','Бородино','Дивногорск','Дудинка','Енисейск','Железногорск','Заозёрный','Зеленогорск','Игарка','Иланский','Канск','Кодинск','Красноярск','Лесосибирск','Минусинск','Назарово','Норильск','Сосновоборск','Ужур','Уяр','Шарыпово','АлупкаОспаривается','АлуштаОспаривается','АрмянскОспаривается','БахчисарайОспаривается','БелогорскОспаривается','ДжанкойОспаривается','ЕвпаторияОспаривается','ИнкерманОспаривается','КерчьОспаривается','КрасноперекопскОспаривается','СакиОспаривается','СимферопольОспаривается','Старый КрымОспаривается','СудакОспаривается','ФеодосияОспаривается','ЩёлкиноОспаривается','ЯлтаОспаривается','Далматово','Катайск','Курган','Куртамыш','Макушино','Петухово','Шадринск','Шумиха','Щучье','Дмитриев','Железногорск','Курск','Курчатов','Льгов','Обоянь','Рыльск','Суджа','Фатеж','Щигры','Бокситогорск','Волосово','Волхов','Всеволожск','Выборг','Высоцк','Гатчина','Ивангород','Каменногорск','Кингисепп','Кириши','Кировск','Коммунар','Лодейное Поле','Луга','Любань','Никольское','Новая Ладога','Отрадное','Пикалёво','Подпорожье','Приморск','Приозерск','Светогорск','Сертолово','Сланцы','Сосновый Бор','Сясьстрой','Тихвин','Тосно','Шлиссельбург','Грязи','Данков','Елец','Задонск','Лебедянь','Липецк','Усмань','Чаплыгин','Магадан','Сусуман','Волжск','Звенигово','Йошкар-Ола','Козьмодемьянск','Ардатов','Инсар','Ковылкино','Краснослободск','Рузаевка','Саранск','Темников','Москва','Апрелевка','Балашиха','Бронницы','Верея','Видное','Волоколамск','Воскресенск','Высоковск','Голицыно','Дедовск','Дзержинский','Дмитров','Долгопрудный','Домодедово','Дрезна','Дубна','Егорьевск','Железнодорожный','Жуковский','Зарайск','Звенигород','Ивантеевка','Истра','Кашира','Климовск','Клин','Коломна','Котельники','Королёв','Красноармейск','Красногорск','Краснозаводск','Краснознаменск','Кубинка','Куровское','Ликино-Дулёво','Лобня','Лосино-Петровский','Луховицы','Лыткарино','Люберцы','Можайск','Московский','Мытищи','Наро-Фоминск','Ногинск','Одинцово','Ожерелье','Озёры','Орехово-Зуево','Павловский Посад','Пересвет','Подольск','Протвино','Пушкино','Пущино','Раменское','Реутов','Рошаль','Руза','Сергиев Посад','Серпухов','Солнечногорск','Старая Купавна','Ступино','Талдом','Троицк','Фрязино','Химки','Хотьково','Черноголовка','Чехов','Шатура','Щёлково','Щербинка','Электрогорск','Электросталь','Электроугли','Юбилейный','Яхрома','Апатиты','Гаджиево','Заозёрск','Заполярный','Кандалакша','Кировск','Ковдор','Кола','Мончегорск','Мурманск','Оленегорск','Островной','Полярные Зори','Полярный','Североморск','Снежногорск','Нарьян-Мар','Арзамас','Балахна','Богородск','Бор','Ветлуга','Володарск','Ворсма','Выкса','Горбатов','Городец','Дзержинск','Заволжье','Княгинино','Кстово','Кулебаки','Лукоянов','Лысково','Навашино','Нижний Новгород','Павлово','Первомайск','Перевоз','Саров','Семёнов','Сергач','Урень','Чкаловск','Шахунья','Боровичи','Валдай','Великий Новгород','Малая Вишера','Окуловка','Пестово','Сольцы','Старая Русса','Холм','Чудово','Барабинск','Бердск','Болотное','Искитим','Карасук','Каргат','Куйбышев','Купино','Новосибирск','Обь','Татарск','Тогучин','Черепаново','Чулым','Исилькуль','Калачинск','Называевск','Омск','Тара','Тюкалинск','Абдулино','Бугуруслан','Бузулук','Гай','Кувандык','Медногорск','Новотроицк','Оренбург','Орск','Соль-Илецк','Сорочинск','Ясный','Болхов','Дмитровск','Ливны','Малоархангельск','Мценск','Новосиль','Орёл','Белинский','Городище','Заречный','Каменка','Кузнецк','Нижний Ломов','Никольск','Пенза','Сердобск','Спасск','Сурск','Александровск','Березники','Верещагино','Горнозаводск','Гремячинск','Губаха','Добрянка','Кизел','Красновишерск','Краснокамск','Кудымкар','Кунгур','Лысьва','Нытва','Оса','Оханск','Очёр','Пермь','Соликамск','Усолье','Чайковский','Чердынь','Чёрмоз','Чернушка','Чусовой','Арсеньев','Артём','Большой Камень','Владивосток','Дальнегорск','Дальнереченск','Лесозаводск','Находка','Партизанск','Спасск-Дальний','Уссурийск','Фокино','Великие Луки','Гдов','Дно','Невель','Новоржев','Новосокольники','Опочка','Остров','Печоры','Порхов','Псков','Пустошка','Пыталово','Себеж','Азов','Аксай','Батайск','Белая Калитва','Волгодонск','Гуково','Донецк','Зверево','Зерноград','Каменск-Шахтинский','Константиновск','Красный Сулин','Миллерово','Морозовск','Новочеркасск','Новошахтинск','Пролетарск','Ростов-на-Дону','Сальск','Семикаракорск','Таганрог','Цимлянск','Шахты','Касимов','Кораблино','Михайлов','Новомичуринск','Рыбное','Ряжск','Рязань','Сасово','Скопин','Спас-Клепики','Спасск-Рязанский','Шацк','Жигулёвск','Кинель','Нефтегорск','Новокуйбышевск','Октябрьск','Отрадный','Похвистнево','Самара','Сызрань','Тольятти','Чапаевск','Зеленогорск','Колпино','Красное Село','Кронштадт','Ломоносов','Павловск','Петергоф','Пушкин','Санкт-Петербург','Сестрорецк','Аркадак','Аткарск','Балаково','Балашов','Вольск','Ершов','Калининск','Красноармейск','Красный Кут','Маркс','Новоузенск','Петровск','Пугачёв','Ртищево','Саратов','Хвалынск','Шиханы','Энгельс','Александровск-Сахалинский','Анива','Долинск','Корсаков','Курильск','Макаров','Невельск','Оха','Поронайск','Северо-Курильск','Томари','Углегорск','Холмск','Шахтёрск','Южно-Сахалинск','Алапаевск','Арамиль','Артёмовский','Асбест','Берёзовский','Богданович','Верхний Тагил','Верхняя Пышма','Верхняя Салда','Верхняя Тура','Верхотурье','Волчанск','Дегтярск','Екатеринбург','Заречный','Ивдель','Ирбит','Каменск-Уральский','Камышлов','Карпинск','СевастопольОспаривается','Качканар','Кировград','Краснотурьинск','Красноуральск','Красноуфимск','Кушва','Лесной','Михайловск','Невьянск','Нижние Серги','Нижний Тагил','Нижняя Салда','Нижняя Тура','Новая Ляля','Новоуральск','Первоуральск','Полевской','Ревда','Реж','Североуральск','Серов','Среднеуральск','Сухой Лог','Сысерть','Тавда','Талица','Туринск','Алагир','Ардон','Беслан','Владикавказ','Дигора','Моздок','Велиж','Вязьма','Гагарин','Демидов','Десногорск','Дорогобуж','Духовщина','Ельня','Починок','Рославль','Рудня','Сафоново','Смоленск','Сычёвка','Ярцево','Благодарный','Будённовск','Георгиевск','Ессентуки','Железноводск','Зеленокумск','Изобильный','Ипатово','Кисловодск','Лермонтов','Минеральные Воды','Михайловск','Невинномысск','Нефтекумск','Новоалександровск','Новопавловск','Пятигорск','Светлоград','Ставрополь','Жердевка','Кирсанов','Котовск','Мичуринск','Моршанск','Рассказово','Тамбов','Уварово','Агрыз','Азнакаево','Альметьевск','Арск','Бавлы','Болгар','Бугульма','Буинск','Елабуга','Заинск','Зеленодольск','Казань','Лаишево','Лениногорск','Мамадыш','Менделеевск','Мензелинск','Набережные Челны','Нижнекамск','Нурлат','Тетюши','Чистополь','Андреаполь','Бежецк','Белый','Бологое','Весьегонск','Вышний Волочёк','Западная Двина','Зубцов','Калязин','Кашин','Кимры','Конаково','Красный Холм','Кувшиново','Лихославль','Нелидово','Осташков','Ржев','Старица','Тверь','Торжок','Торопец','Удомля','Асино','Кедровый','Колпашево','Северск','Стрежевой','Томск','Алексин','Белёв','Богородицк','Болохово','Венёв','Донской','Ефремов','Кимовск','Киреевск','Липки','Новомосковск','Плавск','Суворов','Тула','Узловая','Чекалин','Щёкино','Ясногорск','Советск','Ак-Довурак','Кызыл','Туран','Чадан','Шагонар','Заводоуковск','Ишим','Тобольск','Тюмень','Ялуторовск','Воткинск','Глазов','Ижевск','Камбарка','Можга','Сарапул','Барыш','Димитровград','Инза','Новоульяновск','Сенгилей','Ульяновск','Амурск','Бикин','Вяземский','Комсомольск-на-Амуре','Николаевск-на-Амуре','Советская Гавань','Хабаровск','Абаза','Абакан','Саяногорск','Сорск','Черногорск','Белоярский','Когалым','Лангепас','Лянтор','Мегион','Нефтеюганск','Нижневартовск','Нягань','Покачи','Пыть-Ях','Радужный','Советский','Сургут','Урай','Ханты-Мансийск','Югорск','Аша','Бакал','Верхнеуральск','Верхний Уфалей','Еманжелинск','Златоуст','Карабаш','Карталы','Касли','Катав-Ивановск','Копейск','Коркино','Куса','Кыштым','Магнитогорск','Миасс','Миньяр','Нязепетровск','Озёрск','Пласт','Сатка','Сим','Снежинск','Трёхгорный','Троицк','Усть-Катав','Чебаркуль','Челябинск','Южноуральск','Юрюзань','Аргун','Грозный','Гудермес','Урус-Мартан','Шали','Алатырь','Канаш','Козловка','Мариинский Посад','Новочебоксарск','Цивильск','Чебоксары','Шумерля','Ядрин','Анадырь','Билибино','Певек','Алдан','Верхоянск','Вилюйск','Ленск','Мирный','Нерюнгри','Нюрба','Олёкминск','Покровск','Среднеколымск','Томмот','Удачный','Якутск','Губкинский','Лабытнанги','Муравленко','Надым','Новый Уренгой','Ноябрьск','Салехард','Тарко-Сале','Гаврилов-Ям','Данилов','Любим','Мышкин','Переславль-Залесский','Пошехонье','Ростов','Рыбинск','Тутаев','Углич','Ярославль'];
	City.addList(cities)
	.both(function(data){
		res.send(data);
	});	
};

exports.clearElastic = function(req, res){
	var putOptions = {
        hostname: 'localhost',
        port: 9200,
        path: '/'+elasticConf.index+'/',
        method: 'DELETE'
    };
    var request = Http.request(putOptions, function(result){
		result.setEncoding('utf8');
        var data = '';
        result.on('data', function (chunk) {
            data=data+chunk;
        });
        result.on('end', function(){
            return res.send('zbs');
        });
		result.on('error', function(err){
			return res.send({code: 500, msg: 'database error'});
		});
	});
	request.end();
};

exports.clearPosts = function(req, res){
    Post.remove().exec()
        .then(function(){
           res.send('zbss');
        }, function(){
            res.send('nezbss');
        });
}

exports.blackList = function(req, res){
    Admin.updateLink(req)
    .then(function(link){
        if(link.userGroup!=2) return res.redirect(404, '/error');
            console.log(31);
        return Search.getList({isActive:1, from: req.param('page')||0})
        .then(function(searchResult){
                console.log(11);
            return [Sidebar.getData(), searchResult];
        }, function(err){
           res.send(err);
        })
        .spread(function(sidebar, searchResult){
            console.log(21);
            var pages = Post.getPagination(req.url, 1+(searchResult.total/10>>0));
            return res.render('admin/panel', {
                posts: searchResult.posts,
                cats: sidebar.cats,
                cities: sidebar.cities,
                userGroup: link.userGroup,
                editable:false,
                total: searchResult.total,
                url: req.url,
                pages:pages,
                moder: true
            });
        }, function(err){
                res.send(err);
            });
    }, function(){
        return res.redirect(404, '/error');
    })
};

exports.whiteList = function(req, res){
    Admin.updateLink(req)
    .then(function(link){
        if(link.userGroup!=2) return res.redirect(404, '/error');
        console.log(31);
        return Search.getList({isActive:2, from: req.param('page')||0})
            .then(function(searchResult){
                console.log(11);
                return [Sidebar.getData(), searchResult];
            }, function(err){
                res.send(err);
            })
            .spread(function(sidebar, searchResult){
                console.log(21);
                var pages = Post.getPagination(req.url, 1+(searchResult.total/10>>0));
                return res.render('admin/panel', {
                    posts: searchResult.posts,
                    cats: sidebar.cats,
                    cities: sidebar.cities,
                    userGroup: link.userGroup,
                    editable:false,
                    total: searchResult.total,
                    url: req.url,
                    pages:pages,
                    moder: true
                });
            }, function(err){
                res.send(err);
            });
    }, function(){
        return res.redirect(404, '/error');
    });
};

exports.unseenList = function(req, res){
    Admin.updateLink(req)
    .then(function(link){
        if(link.userGroup!=2) return res.redirect(404, '/error');
        return Search.getList({isActive:0, from: req.param('page')||0})
            .then(function(searchResult){
                return [Sidebar.getData(), searchResult];
            }, function(err){
                res.send(err);
            })
            .spread(function(sidebar, searchResult){
                var pages = Post.getPagination(req.url, 1+(searchResult.total/10>>0));
                return res.render('admin/panel', {
                    posts: searchResult.posts,
                    cats: sidebar.cats,
                    cities: sidebar.cities,
                    userGroup: link.userGroup,
                    editable:false,
                    total: searchResult.total,
                    url: req.url,
                    pages:pages,
                    moder: true
                });
            }, function(err){
                res.send(err);
            });
    }, function(){
        return res.redirect(404, '/error');
    })
};

exports.banPost = function(req, res){
    Post.ban(req.param('id'))
    .then(function(){
        res.redirect('/admin/posts/blackList');
    }, function(err){
        res.send(err);
    });
};

exports.unBanPost = function(req, res){
    Post.ban(req.param('id'), true)
    .then(function(){
        res.redirect('/admin/posts/whiteList');
    }, function(err){
        res.send(err);
    });
};